app/Controllers/DashboardController.php

    public function index()
    {
        // Initialize models
        $asnModel = new AsnModel();
        $approverModel = new ApproverModel();
        $permohonanModel = new PermohonanModel();
        $persetujuanModel = new PersetujuanModel();

        // Get counts from each table
        $data['jumlahAsn'] = $asnModel->countAll();
        $data['jumlahApprover'] = $approverModel->countAll();
        $jumlahPermohonan = $permohonanModel->join('asn','asn.id_asn=permohonan.id_asn')->findAll();
        $jumlahPersetujuan = $persetujuanModel->join('permohonan','permohonan.id_pemohon=persetujuan.id_pemohon','left')->join('asn','asn.id_asn=permohonan.id_asn')->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `asn`
SELECT COUNT(*) AS `numrows` FROM `approver`
SELECT *
FROM `permohonan`
JOIN `asn` ON `asn`.`id_asn`=`permohonan`.`id_asn`
SELECT *
FROM `persetujuan`
LEFT JOIN `permohonan` ON `permohonan`.`id_pemohon`=`persetujuan`.`id_pemohon`
JOIN `asn` ON `asn`.`id_asn`=`permohonan`.`id_asn`