app/Controllers/Home.php

    public function proses_login()
    {
        // Ambil inputan dari form
        $username = $this->request->getPost('username');
        $password = md5($this->request->getPost('password'));
        // var_dump($password);exit;
        // Instansiasi model
        $loginModel = new LoginModel();

        // Cari user berdasarkan username
        $user = $loginModel->where('username', $username)->first();
        // var_dump($user['password']);exit;

        // Cek apakah user ditemukan dan password cocok
        if ($password==$user['password']) {
            // Jika login berhasil, simpan data ke session
            $asn = $this->AsnModel->where('id_login', $user['id_login'])->first();
---
SELECT *
FROM `login`
WHERE `username` = 'admin'
 LIMIT 1
SELECT *
FROM `asn`
WHERE `id_login` = '1'
 LIMIT 1