app/Controllers/PermohonanController.php

    public function baru()
    {
        if (session('level')=='asn') {
            $data['pemohon'] = $this->PermohonanModel
        ->join('asn','asn.id_asn=permohonan.id_asn','left')
        ->where('status','tunggu')
        ->where('id_login',session('id_login'))
        ->findAll();
        }else{

            $data['pemohon'] = $this->PermohonanModel
            ->join('asn','asn.id_asn=permohonan.id_asn','left')
            ->where('status','tunggu')
            ->findAll();
---
SELECT *
FROM `permohonan`
LEFT JOIN `asn` ON `asn`.`id_asn`=`permohonan`.`id_asn`
WHERE `status` = 'tunggu'
AND `id_login` = '15'
SELECT *
FROM `permohonan`
LEFT JOIN `asn` ON `asn`.`id_asn`=`permohonan`.`id_asn`
WHERE `status` = 'tunggu'

    public function detailPermohonan($id)
    {
        // Ambil data permohonan berdasarkan ID dan join dengan alamatrumahdinas, asn, golonganpangkat
        $data['skpd'] = $this->SkpdModel->findAll();
        $data['golrum'] = $this->GolonganRumahDinasModel->findAll();
        $data['pencatatan'] = $this->InstansiPencatatanModel->findAll();
        $data['jumlah_keluarga'] = $this->KeluargaModel
            ->join('asn', 'asn.id_asn = keluarga.id_asn')
            ->join('permohonan', 'permohonan.id_asn = asn.id_asn')
            ->where('permohonan.id_pemohon', $id)
            ->countAllResults();
        $data['permohonan'] = $this->PermohonanModel
            ->select('permohonan.*, alamatrumahdinas.nama_alamatrumahdinas, asn.*, golonganpangkat.nama_golonganpangkat,instansipemohon.*')
            ->join('alamatrumahdinas', 'alamatrumahdinas.id_alamatrumahdinas = permohonan.id_alamatrumahdinas', 'left')
            ->join('asn', 'asn.id_asn = permohonan.id_asn', 'left')
            ->join('golonganpangkat', 'golonganpangkat.id_golonganpangkat = asn.id_golonganpangkat', 'left')
            ->join('instansipemohon', 'instansipemohon.id_instansipemohon = asn.id_instansipemohon', 'left')
            ->find($id);
---
SELECT *
FROM `skpd`
SELECT *
FROM `golonganrumahdinas`
SELECT *
FROM `instansipencatatan`
SELECT COUNT(*) AS `numrows`
FROM `keluarga`
JOIN `asn` ON `asn`.`id_asn` = `keluarga`.`id_asn`
JOIN `permohonan` ON `permohonan`.`id_asn` = `asn`.`id_asn`
WHERE `permohonan`.`id_pemohon` = '22'
SELECT `permohonan`.*, `alamatrumahdinas`.`nama_alamatrumahdinas`, `asn`.*, `golonganpangkat`.`nama_golonganpangkat`, `instansipemohon`.*
FROM `permohonan`
LEFT JOIN `alamatrumahdinas` ON `alamatrumahdinas`.`id_alamatrumahdinas` = `permohonan`.`id_alamatrumahdinas`
LEFT JOIN `asn` ON `asn`.`id_asn` = `permohonan`.`id_asn`
LEFT JOIN `golonganpangkat` ON `golonganpangkat`.`id_golonganpangkat` = `asn`.`id_golonganpangkat`
LEFT JOIN `instansipemohon` ON `instansipemohon`.`id_instansipemohon` = `asn`.`id_instansipemohon`
WHERE `permohonan`.`id_pemohon` = '22'

    public function update_status_terima($id)
    {

        $id_login=session('id_login');
        $approver = $this->ApproverModel->where('id_login', $id_login)->first();
        // var_dump($approver['id_approver']);exit;

        $data = $this->PermohonanModel
        ->join('asn','asn.id_asn=permohonan.id_asn','left')
        ->join('login','login.id_login=asn.id_login')
        ->find($id);
        $email=$data['username'];
        $nama=$data['gelar_depan'].' '.$data['nama'].', '.$data['gelar_belakang'];

        // var_dump($email);exit;
        if (null !== $this->request->getPost('terima')) {

            $this->PermohonanModel->update($id, [
                'status' => 'terima',
                'id_approver'=>$approver['id_approver']
            ]);
---
SELECT *
FROM `approver`
WHERE `id_login` = '9'
 LIMIT 1
UPDATE `permohonan` SET `status` = 'terima', `id_approver` = '5'
WHERE `permohonan`.`id_pemohon` IN ('22')

            ];

            // Assuming you have a model for persetujuan
            $this->PersetujuanModel->insert($dataPersetujuan);
---
INSERT INTO `persetujuan` (`tanggal_mulai`, `tanggal_berakhir`, `id_skpd`, `id_golrum`, `id_instansipencatatan`, `id_pemohon`) VALUES ('2024-12-28', '2024-12-29', '2', '2', '4', '22')