app/Controllers/PersetujuanController.php

    public function index()
    {
        // Ambil semua data persetujuan
        if (session('level')=='asn') {
        $data['persetujuan'] = $this->PersetujuanModel
        ->join('golonganrumahdinas','golonganrumahdinas.id_golrum=persetujuan.id_golrum','left')
        ->join('instansipencatatan','instansipencatatan.id_instansipencatatan=persetujuan.id_instansipencatatan','left')
        ->join('skpd','skpd.id_skpd=persetujuan.id_skpd','left')
        ->join('permohonan','permohonan.id_pemohon=persetujuan.id_pemohon','left')
        ->join('asn','asn.id_asn=permohonan.id_asn')
        ->where('id_login',session('id_login'))
        ->findAll();
        }
        else{
            $data['persetujuan'] = $this->PersetujuanModel
        ->join('golonganrumahdinas','golonganrumahdinas.id_golrum=persetujuan.id_golrum','left')
        ->join('instansipencatatan','instansipencatatan.id_instansipencatatan=persetujuan.id_instansipencatatan','left')
        ->join('skpd','skpd.id_skpd=persetujuan.id_skpd','left')
        ->join('permohonan','permohonan.id_pemohon=persetujuan.id_pemohon','left')
        ->join('asn','asn.id_asn=permohonan.id_asn')
        ->findAll();
---
SELECT *
FROM `persetujuan`
LEFT JOIN `golonganrumahdinas` ON `golonganrumahdinas`.`id_golrum`=`persetujuan`.`id_golrum`
LEFT JOIN `instansipencatatan` ON `instansipencatatan`.`id_instansipencatatan`=`persetujuan`.`id_instansipencatatan`
LEFT JOIN `skpd` ON `skpd`.`id_skpd`=`persetujuan`.`id_skpd`
LEFT JOIN `permohonan` ON `permohonan`.`id_pemohon`=`persetujuan`.`id_pemohon`
JOIN `asn` ON `asn`.`id_asn`=`permohonan`.`id_asn`
WHERE `id_login` = '15'
SELECT *
FROM `persetujuan`
LEFT JOIN `golonganrumahdinas` ON `golonganrumahdinas`.`id_golrum`=`persetujuan`.`id_golrum`
LEFT JOIN `instansipencatatan` ON `instansipencatatan`.`id_instansipencatatan`=`persetujuan`.`id_instansipencatatan`
LEFT JOIN `skpd` ON `skpd`.`id_skpd`=`persetujuan`.`id_skpd`
LEFT JOIN `permohonan` ON `permohonan`.`id_pemohon`=`persetujuan`.`id_pemohon`
JOIN `asn` ON `asn`.`id_asn`=`permohonan`.`id_asn`

    public function cetak($id)
    {
        $data['persetujuan'] = $this->PersetujuanModel
        ->select('asn.*, approver.nip as nip_app, approver.nama as nama_app,nama_golonganpangkat,kop_skpd,nama_alamatrumahdinas,biaya_sewa,nomor_rumah_dinas,nama_instansipemohon,golongan_rumah,kepala_skpd, nip_kepala_skpd,jabatan,tanggal_ditempati,tanggal_mulai, tanggal_berakhir')
        ->join('golonganrumahdinas','persetujuan.id_golrum=golonganrumahdinas.id_golrum','left')
        ->join('skpd','skpd.id_skpd=persetujuan.id_skpd','left')
        ->join('permohonan','permohonan.id_pemohon=persetujuan.id_pemohon','left')
        ->join('asn','asn.id_asn=permohonan.id_asn','left')
        ->join('instansipemohon','instansipemohon.id_instansipemohon=asn.id_instansipemohon','left')
        ->join('golonganpangkat','golonganpangkat.id_golonganpangkat=asn.id_golonganpangkat','left')
        ->join('approver','approver.id_approver=permohonan.id_approver','left')
        ->join('alamatrumahdinas','alamatrumahdinas.id_alamatrumahdinas=permohonan.id_alamatrumahdinas','left')
        ->where('id_persetujuan',$id)
        ->first();
        $id_asn = $data['persetujuan']['id_asn'];
        $data['keluarga'] = $this->KeluargaModel->where('id_asn', $id_asn)->findAll();
---
SELECT `asn`.*, `approver`.`nip` as `nip_app`, `approver`.`nama` as `nama_app`, `nama_golonganpangkat`, `kop_skpd`, `nama_alamatrumahdinas`, `biaya_sewa`, `nomor_rumah_dinas`, `nama_instansipemohon`, `golongan_rumah`, `kepala_skpd`, `nip_kepala_skpd`, `jabatan`, `tanggal_ditempati`, `tanggal_mulai`, `tanggal_berakhir`
FROM `persetujuan`
LEFT JOIN `golonganrumahdinas` ON `persetujuan`.`id_golrum`=`golonganrumahdinas`.`id_golrum`
LEFT JOIN `skpd` ON `skpd`.`id_skpd`=`persetujuan`.`id_skpd`
LEFT JOIN `permohonan` ON `permohonan`.`id_pemohon`=`persetujuan`.`id_pemohon`
LEFT JOIN `asn` ON `asn`.`id_asn`=`permohonan`.`id_asn`
LEFT JOIN `instansipemohon` ON `instansipemohon`.`id_instansipemohon`=`asn`.`id_instansipemohon`
LEFT JOIN `golonganpangkat` ON `golonganpangkat`.`id_golonganpangkat`=`asn`.`id_golonganpangkat`
LEFT JOIN `approver` ON `approver`.`id_approver`=`permohonan`.`id_approver`
LEFT JOIN `alamatrumahdinas` ON `alamatrumahdinas`.`id_alamatrumahdinas`=`permohonan`.`id_alamatrumahdinas`
WHERE `id_persetujuan` = '22'
 LIMIT 1
SELECT *
FROM `keluarga`
WHERE `id_asn` = '18'